Revit 2027 API
LineLightShape(Double) Constructor
 Creates a line light shape object with the given emit length.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LineLightShape(
	double emitLength
)
Public Sub New (
	emitLength As Double
)
public:
LineLightShape(
	double emitLength
)
new :
        emitLength : float -> LineLightShape
Parameters
emitLength Double
 The emit length as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace